{"results": [{"link": "https://www.cbssports.com/nfl/news/2020-nfl-draft-ranking-all-29-trades-from-saints-questionable-moves-to-affordable-round-1-deals-and-more/", "title": "2020 NFL Draft: Ranking all 29 trades, from Saints' questionable moves to affordable Round 1 deals and more - CBSSports.com", "text": "\n                                                            Play Now\n                                                        \nFANTASY BASEBALL\n\n                                                            Play Now\n                                                        \nFRANCHISE SPORTS\n\nMailbag!\n\nCovering the impact of coronavirus on the sports world\nThe 2020 NFL Draft has come and gone, and while it took a little while for the trade lines to start buzzing, we wound up with more deals than expected during the three-day event. While the moves made didn't come anywhere near the 40 trades struck during last year's draft, we saw 29 swaps go down in all this year, with the vast majority coming on Days 2 and 3.The process is not-at-all scientific: I look at the value of each pick involved in a trade, based upon the draft value chart detailed here that estimates the values of picks based upon trades that have actually happened in recent years. That provides a base score for whether a team over-or-underpaid.I then look at the asset they targeted in the deal -- and here it's important to note that we're grading the team that either moved up for a pick that was on the clock at the time, or that added a veteran in a deal that involved picks yet to come -- and use my subjective opinion on whether the acquiring team landed a prospect that wouldn't have been there at their previous pick, and whether the targeted prospect made sense as someone who could have an impact.Confused? Probably. It boils down to this: I graded every team that felt the need to make a trade in the draft to go get someone. Then I ranked them from worst to best. Let's get started.Zack Baun fell further than he should have in the draft, and trades that happen for players who fit that category typically aren't ones you find at the end of these rankings, especially not in the last spot. But the drop-off in pure value between this deal and the next-worst one (which we won't get to until No. 22) was about equal to the gap between that second-worst deal and the fourth-best trade made. If you're lapping the field in terms of value surrendered, that's a problem.Future picks are assigned a value equal to the last pick in that round, which has been a pretty good method in calculating deals over the last five years. And I'm giving an even bigger penalty during the subjective part of my analysis for trading away future picks this year, as the coronavirus-impacted predraft process left teams able to do far less than they typically could. Assuming things are back to normal next year, predraft evaluations are going to be more complete with the lack of restrictions imposed on teams and prospects. So those are picks you'd rather have than ones this year where your evaluations may be incomplete, and that's going to be reflected in many of the deals you'll find among the worst on my list.Maybe the Patriots have big plans for Dalton Keene after trading up to take him 10 picks after they landed another tight end in Devin Asiasi. But there weren't many people who thought the Virginia Tech tight end would go on Day 2, so this would have been seen as a reach even if it had cost the Patriots one pick instead of three. And that third pick coming in 2021 doesn't help, nor does this deal being an overpay even if you throw that pick out and just make it a 2-for-1. If not for the Saints trading away a Day 2 pick in next year's draft, this deal would have been 2020's worst.I don't love trading the future pick for a fifth-rounder this year, which is where most of the issue lies with the deal. But if the Bears had made the move to land Boise State edge rusher Curtis Weaver, a Day 2 talent who lasted until No. 164, I would have felt better about sacrificing that future pick, rather than selecting Trevis Gipson. The Bears are already down to five picks in next year's draft after this deal.The next three spots in my rankings feature similar deals, with teams trading away future sixth-round picks in a draft class where they'll be able to do more work on prospects for end-of-draft lottery tickets they could have very well landed as undrafted free agents. The Saints rank last since the player they took, Tommy Stevens, appears ticketed for grooming for a Taysom Hill-type role, which means far fewer teams were likely to have their eye on him as a developmental prospect. And if you really wanted to take him on Day 3, maybe don't trade away all of your Day 3 picks before the end of Round 3.The Seahawks added Greg Olsen to the top of their depth chart earlier this offseason, then picked up a pretty good Day 3 tight end in Colby Parkinson. So why feel the need to get into the final five picks of the draft for another tight end project in Stephen Sullivan? Making things more confusing, two of the picks behind this one belonged to the Broncos, who were well-stocked with receiving threats at tight end after their selection of Albert Okwuegbunam. This felt like an unnecessary deal to make.The Chiefs' move ranks best of our three 2021 sixth-round pick deals as they addressed a key need where they had to add depth, though they selected a player with a UDFA grade. They also landed the earliest pick of the three moves, preventing more teams from taking the guy they wanted.This deal was the fifth-worst in terms of pure value in the draft, as Seattle should have gotten around the 203rd pick back in value for surrendering these two Day 2 selections. But they did address a key need on the defensive line with Darrell Taylor, though it's up for debate whether he should have been the player chosen over someone like A.J. Epenesa, who went six picks later, or even Josh Uche or Julian Okwara, who would have been available at Seattle's initial pick.You could make arguments for giving this deal a better ranking (big drop-off at the tackle position after Tristan Wirfs, and who knows who could have traded into the No. 13 spot) or a worse one (this was the second-worst deal made in terms of pure value, with the Bucs losing out on the equivalent of about No. 170). This feels just about right to me, settling in just ahead of two deals where teams had to sacrifice future capital but also got good players at a value.The Cowboys probably made the right call in sacrificing a future fifth-rounder for Tyler Biadasz, who was a projected first-round pick at this time last year, but we'll be able to see that process play out in real time. If the Wisconsin center can smooth over the loss of Travis Frederick and establish himself as the team's center for the next decade, it'll be well worth the price paid. But there's a reason other teams let Biadasz slip to the end of the fourth round.This deal checks in as the sixth-worst from a value perspective, but at least the Patriots addressed a key need. However, it was surprising to see them take Devin Asiasi, who was seen as a Day 3 sleeper, late on Day 2 when the much more heralded Adam Trautman was still on the board. If the Pats had snagged the Dayton product, I'd have a better grade on this deal.In a draft this deep with receiving talent, there wasn't really a need to move up to land help at receiver. If you're going to do so, you had better be drafting a player that has no business still being on the board. But not only was Darrell Mooney far from the best receiver available, several receivers with much higher grades were still available at both of the Bears' original picks, including Quez Watkins, who the Eagles selected with one of those picks they acquired from Chicago.The Dolphins had a major need on the offensive line, so it wasn't all that surprising to see them spend three of their first seven picks on help up front. Kindley is a solid pick where he was taken, and it's possible he wouldn't have been on the board at No. 136. But the thing that keeps this deal from a better ranking is the value lost, as Miami should have been able to get a little something back. However, with all the draft capital Miami had entering the draft, it's hard to ding the Dolphins too much.  Jeremy Chinn entered draft weekend with some potential first-round buzz, so it's hard to knock the Panthers for getting him at the end of the second round. It's also possible he wouldn't have made it five more picks to Carolina, as the Jets also took a safety one pick ahead of the Panthers' original selection. The only reason this trade doesn't have a better grade is the overpay, as the Panthers should have been able to get a seventh-rounder back at this price.I wanted to be more negative in grading this deal, as the Ravens surrendered a future pick in the move. But Baltimore was also able to recoup some value in the swap of seventh-rounders, and that move proved prescient as they landed an incredible value at their new Round 7 pick of No. 219 in safety Geno Stone. And the player they moved up here, James Proche, should have been long off the board by No. 201 as well. Losing a future pick is the only reason to knock this deal.I certainly thought I was going to be more negative on a deal that cost the Saints four draft picks and meant they were scheduled to sit out all of Day 3. But the value actually wasn't terrible in landing No. 105 for that collection of picks, and the player they got at the end of Day 2, Adam Trautman, was the fifth tight end taken despite most considering him one of the top options at the position. Some even had him ranked ahead of No. 43 overall pick Cole Kmet.The Patriots lost a slight bit of value in this move and I'm not sure they needed to move up the board for Michael Onwenu. Had they managed to leap one more pick and land Fresno State's Netane Muti, that would have been a coup and certainly worth a much higher grade. But the Patriots march to the beat of their own drum when it comes to evaluating prospect talent, so at least this move wasn't made for a kicker.Like the Patriots, the Raiders made a move up the board and lost a tiny bit of value to select a guard, but I don't think it was as much of a reach landing John Simpson where they got him. He'll have a decent chance of emerging as a starter down the road for this team.I don't mind going to get the talented Matt Breida to add to the running game, but of the pick-for-veteran deals, this felt like the biggest overpay, considering how fungible the running back position is. Will he be that much better than backs that went in the seventh round like Eno Benjamin or Raymond Calais, or than the options available as free agents after the draft? The Dolphins should have shipped out their sixth-rounder rather than using it on a long snapper, then found a player at a position of need at No. 153.Here's another veteran deal I don't mind, with this one coming at a much more affordable price. Quincy Wilson has a much better chance at contributing than any corner you're going to find in the 200s of a draft, especially the guy the Colts replaced Wilson with at No. 211 in Isaiah Rodgers, who was completely off the radar and likely could have been had after the draft.The Eagles came into this draft focused on adding speed at the receiver position, starting right at the top with their selection of Jalen Reagor. They added two more value picks on Day 3 in John Hightower and Quez Watkins, but also made the negligible move back 20 spots for an established veteran in Marquise Goodwin. The price suggests he probably would have been available as a free agent, but I don't hate spending the equivalent of the 246th pick to keep him off the market.Curtis Weaver was a fantastic find this late in the draft, as we projected him to come off the board sometime on Day 2. He's a great addition for a Dolphins team that needs to develop young talent on the defensive side of the ball. The only knock on the deal is that it was a slight overpay getting to No. 164, but that's not a huge hang-up when the player added should have been long off the board.  The Texans finally entered a draft without massive holes to address on the offensive line, so this seems like the perfect time to trade up for a tackle. But it's hard to knock this deal too much, as there was a big drop-off at the tackle position around this part of the draft, and this is the first of seven trades where the team moving up actually gained value in the deal instead of losing it (though in this case, the amount gained was basically nothing).The Lions had a clear need up front, and Jonah Jackson is good enough to compete for a starting job right out the gate. With the Lions also gaining positive value in the move up despite surrendering three picks in the deal, that makes this move one of the better ones in this year's draft.You probably expected to see this deal much earlier in this article, as the trade was widely panned for a team with Aaron Rodgers at quarterback that fell one game short of reaching the Super Bowl last year. And that factor is what knocks this trade back to No. 6, because if you just look at the value of the picks traded, this was the most valuable move up in this year's draft, with the Packers gaining roughly the value of the 187th pick in this deal. Time will tell if Jordan Love can live up to being Rodgers' successor, but had the pick itself made more sense (say, linebacker Patrick Queen), this move would have been our clear No. 1.This was the fourth-best move in terms of positive value gained by the team moving up, but you can make an argument for grading this trade a little worse than I have it. With the depth at receiver, it's not like the 49ers had to pull the trigger on a deal, and for a team that entered the draft without a ton of premium picks, it was surprising to see them sacrifice the fourth-round pick they landed from the Bucs earlier in Round 1 in this move. But the value of the deal makes it a win for the team, especially if Brandon Aiyuk can develop into a key piece of the offense.While I'm typically against paying a premium to land a running back considering the devaluation of the position, this actually represented a positive-value trade for Indianapolis, and Jonathan Taylor was the RB1 on some boards heading into the draft. With Jacksonville picking next at No. 42 and making it clear they're ready to move on from Leonard Fournette, the Colts did a good job potentially stealing Taylor from their division rival.This checks in as the third-best pure value move on the board, with New England adding the equivalent of the 213th pick in this pick swap. And they addressed a key need for edge rush help with a potential Kyle Van Noy successor in Josh Uche, who could have went at any point on Day 2 and not been a reach. He was highly unlikely to make it 11 more picks, and the Patriots were able to not lose a selection in the move, instead, trading back 31 spots later in the draft.The Trent Williams market never materialized as expected, so when the 49ers found out left tackle Joe Staley was about to retire, they were able to pay a reasonable price to go get a replacement who has made seven Pro Bowls in his career. And while I bashed trading away future picks in other deals, this is one where the 49ers know what they're getting in the acquired player rather than taking a gamble on a prospect. This trade package values Williams as about the 86th pick in the draft, and considering the price paid to acquire other top tackles in years past such as Laremy Tunsil and Duane Brown, this move qualifies as a steal.The Chargers don't make many draft-day trades, but when they do, apparently they make them count. This deal qualified as the second most valuable for the team trading up, with L.A. landing the equivalent of the 192nd pick in value to make this move. While it cost them the chance to add offensive tackle help on Day 2, they did address a key need on the defensive side of the ball with a prospect in Kenneth Murray that had no shot at being available at No. 37. If they would have beat San Francisco to the punch and traded No. 151 and a future third for Williams, then they might have been declared one of the biggest winners of the draft. As it is, they'll have to settle for making the best draft-day trade of 2020.\nI agree that CBS Sports can send me the \"Pick Six Newsletter\" newsletter.\n© 2004-2020 CBS Interactive. All Rights Reserved.CBS Sports is a registered trademark of CBS Broadcasting Inc. Commissioner.com is a registered trademark of CBS Interactive Inc.Images by Getty Images and US Presswire"}, {"link": "https://www.neworleanssaints.com/news/saints-sign-defensive-lineman-margus-hunt-free-agency", "title": "Saints sign defensive lineman Margus Hunt ", "text": "\n                  Friday, May 01, 2020 04:20 PM\n                The New Orleans Saints announced today that they have signed free agent defensive lineman Margus Hunt. The announcement was made by Saints' Executive Vice President/General Manager Mickey Loomis.Hunt, 6-8, 295, is a seven-year NFL veteran who was originally selected by the Cincinnati Bengals in the second round (53nd overall) in the 2013 NFL Draft out of Southern Methodist. In seven seasons for Cincinnati (2013-16) and and Indianapolis (2017-19), he's played in 91 regular season games with 25 starts, recording career totals of 101 tackles (68 solo), 7.5 sacks, seven passes defensed, one forced fumble, one fumble recovery and four special teams stops. Hunt has played in four postseason games with two starts, posting six tackles (four solo) and one split sack.Hunt played in all 16 games with five starts for Indianapolis in 2019, making 17 tackles (14 solo). In 2018, he opened all 15 regular season games he played in and posted 22 tackles, a career-high five sacks, two passes defensed, one forced fumble and one fumble recovery, chipping in four more stops in two postseason starts.A 31-year-old native of Karksi-Nuia, Estonia, Hunt attended Southern Methodist University where he finished his collegiate career as the NCAA's all-time leader in blocked field goals (10) and ranked second in blocked kicks. He opened 27-of-53 games at SMU, compiling 112 tackles (60 solo), 28.0 tackles for loss, 16.5 sacks, seven passes defensed, two forced fumbles and one fumble recovery.In 2006, at age 18, Hunt won Estonia's first two gold medals in the World Junior Track and Field Championships with a discus throw of 67.32 meters and a shot put of 20.53 meters, becoming the first athlete in the event to capture gold in both discus and shot put.'I'd be ready to go wherever they needed me'Saints quarterback speaks to media after signing with New Orleans'If you have faith that you will become a starting quarterback again, you take this opportunity in a heartbeat''I know what it takes to be a good quarterback'In 2019, Hill played in all 16 regular season games with five various skill position starts and posted a career-high 22 receptions for 240 yards and six touchdownsSaints made trade to get into seventh round to pick StevensDefensive back talks with local media about re-signing with SaintsEight of nine starters on offensive and defensive lines were Saints draft picksReturner Deonte Harris, defensive back J.T. Gray were All-Pros last season'I wanted to capture the opportunity to have a financial platform to start my life'\n    © 2019 New Orleans Saints. All Rights Reserved\n  "}, {"link": "https://www.nola.com/sports/saints/article_40ccde2c-8bfc-11ea-a7bc-8703bf596eb5.html", "title": "Malcolm Roach stayed home with the Saints because they were the best fit for him | Saints | nola.com", "text": "Texas defensive lineman Malcolm Roach (32) celebrates a fumble recovery against Georgia during the Sugar Bowl NCAA college football game on Tuesday, Jan. 1, 2019, in New Orleans, Louisiana. [NICK WAGNER/AMERICAN-STATESMAN]Malcolm Roach grew up in a family that supported the New Orleans Saints, but don’t get it twisted, he did not choose to come here to fulfill some childhood fantasy of wearing the black and gold.Roach, who grew up in Baton Rouge as the son of a football coach before playing collegiately at Texas, signed an undrafted rookie free agent contract with the Saints because they were the team that offered him the best shot at succeeding in the NFL.“I just felt like it was the best-case scenario for me to go there,” Roach said.It was a best-case scenario from one perspective, but to get to it he had to go through the “worst-case scenario” in which he went undrafted.He said the Saints first reached out to gauge his interest sometime in the fourth round, which gave him the comfort of knowing he had a home for the start of his professional career if he wasn’t picked, but he was also hopeful to see his name flash across the screen on Day 3 of the draft.But when it didn’t happen, Roach was prepared. He said he and his agent did the legwork about a week before the draft started to prepare for Plan B in the event he wasn’t drafted.They went through schemes and depth charts and they looked at the money teams have paid out to undrafted players in recent seasons. Roach liked that the Saints have shown a willingness to not only keep undrafted players on their roster, but to offer them avenues to flourish.He liked the way the Saints’ defensive philosophy seemed to suit his talent.At 6-foot-3 and 290 pounds, Roach possesses the size the Saints like in their defensive ends, but he also brings some athleticism to the position. He played both defensive line and linebacker at Texas, where he finished his career with 22.5 tackles for loss and eight sacks in 47 games.“They love defensive linemen that can play multiple positions,” Roach said. “They love getting upfield, getting to the quarterback, things like that. Being a defensive linemen that can play multiple positions, it’s very big in my situation. Being able to move around in sub packages is very big.”The goal is to make an NFL roster and play on Sundays, and if he does so he’ll have an interesting story to tell. If he makes a team, the first NFL game Roach will ever attend will be a game he is playing in.But while his experience in the building is entirely disconnected from Saints fandom, neither Roach nor his family are strangers to the Superdome.There were all the Bayou Classic games. His father, Mike, played collegiately at Southern and his older brother, Mike Jr., was an all-conference safety at Grambling. Despite the connections on both sides of the rivalry, Roach never had to think too hard about which team to support because his father was serving as Grambling’s defensive coordinator when Roach first started going to the games.“I always ended up cheering for Grambling,” Roach said.Though he just missed out on playing there in a state-title game as a high-schooler, Roach finally got to play in the Dome himself when Texas played Georgia in the Sugar Bowl at the conclusion of his junior season, recording four tackles in a 28-21 win.Now he hopes to add one more chapter to his family’s legacy of playing in the building. He just has to get through all these messages first.Roach’s phone lit up after news broke he’d signed with the Saints, and the flood hasn’t abated much in the six days that have followed. That’ll happen when signing up to play for the home-state team.Honestly, he said, there have been so many messages he has not been able to respond to them. So he asked for a little help getting the word out in case those local friends and family members are reading.“Just tell them I saw the messages. I appreciate everything,” Roach said.\nSuccess! An email has been sent with a link to confirm list signup.\n            \nError! There was an error processing your request.\n            Become a Saints insider and have the latest Saints news sent to your e-mail inbox. Sign up today!Email Luke Johnson at ljohnson@theadvocate.com.News Tips:newstips@theadvocate.comOther questions:subscriberservices@theadvocate.comNeed help? "}, {"link": "https://www.nola.com/sports/saints/article_bec6fdc6-8bde-11ea-ac6b-abd1ba219578.html", "title": "When the Saints got tired of asking Tommy Stevens to join them, they forced the issue | Saints | nola.com", "text": "Mississippi State quarterback Tommy Stevens (7) plays against Louisville in the first half of the Music City Bowl NCAA college football game Monday, Dec. 30, 2019, in Nashville, Tenn. (AP Photo/Mark Humphrey)Sean Payton wanted Mississippi State quarterback Tommy Stevens, and he got tired of asking nicely.Stevens joined the \"Hangin’ With Hester\" radio show in Baton Rouge on Friday to speak about his experience with last week’s NFL draft. The New Orleans Saints traded back into the seventh round to select Stevens 240th overall, and Stevens shared a funny story about how that came to be.The story of how Tommy Stevens (@TMS_II) ended up with the New Orleans @Saints is intriguing! The second phone call from Sean Payton was different from the first. We had Tommy on @HanginOn1045, and here is that story from the man himself.Full interview: https://t.co/g7j1MPDuNi pic.twitter.com/RGofNhf2XhDuring the pre-draft process, Stevens said he’d whittled his personal list of teams he thought would be a great fit for him to three — and the Saints were included in that number.He wrote off the Saints as a potential landing spot in the draft after the team traded away all of its Day 3 picks to select Dayton tight end Adam Trautman in the third round a day prior. But his preferred landing spots would be useful information for him if he went undrafted, and as the draft stretched into the seventh round, it appeared that would be the case.Then he received a call from a number he didn’t recognize with a Texas area code. He looked up on the TV screen, but did not see the NFL’s two Texas-based teams with a pick coming up. Curious, Stevens answered the call, and Payton was on the other line.“I hadn’t talked to coach Payton yet, so it was a bit of a surprise,” Stevens said. “I was kind of caught off guard by it, but getting to talk to coach Payton, someone of his magnitude, it was awesome.”Payton started to make a pitch to Stevens about why Stevens should sign with New Orleans after the draft, that the team had a “unique vision” for him as a player and thought he would be a fit in the organization. There was just one problem.“At the time, I thought I was actually going to have a better fit in another place,” Stevens said. “So, as polite and respectful as I could, I told coach Payton, ‘Hey, I think my best situation might be going a different route.’ ”Payton said he would call back, and a few minutes later they were on the line again. This time, Stevens’ agent got in on the call. Payton made the pitch again, but Stevens and his agent were unmoved. That set up the third call from Payton, which included a line Stevens won’t soon forget.He received another call from a number he did not recognize, only this time it came from a 504 area code. He answered, and Payton was on the line with Saints general manager Mickey Loomis.“Coach Payton said this, and I’ll never forget it: ‘Last time I called you, I was asking you to come to New Orleans, but this time I’m not giving you the choice. We’re going to trade up in the draft, and we’re going to take you,’ ” Stevens recalled.The Saints sent a 2021 sixth-round pick to Houston for the No. 240 pick, which they used to select Stevens.While he may have ultimately had his personal free agency stripped from him at the last minute, Stevens was happy with where he landed.“I still have a lot of room to grow as a quarterback, and what better opportunity is there anywhere else in the league than to go into the quarterback room that I’m going into,” Stevens said. “Learning from all these different guys that have different skillsets, experiences. I can’t think of a better situation.”\nSuccess! An email has been sent with a link to confirm list signup.\n            \nError! There was an error processing your request.\n            Become a Saints insider and have the latest Saints news sent to your e-mail inbox. Sign up today!Email Luke Johnson at ljohnson@theadvocate.com.“I just felt like it was the best-case scenario for me to go there,” Roach said.“I just felt like it was the best-case scenario for me to go there,” Roach said.News Tips:newstips@theadvocate.comOther questions:subscriberservices@theadvocate.comNeed help? "}]}
